---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntries.Dispose
source: html/b5cbc62a-6195-28d6-bddf-165beaf81e39.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntries.Dispose Method

Releases all resources used by the KeyBasedTreeEntries

## Syntax (C#)
```csharp
public void Dispose()
```